RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_cmp.c
/**
 *******************************************************************************
 * @file  hc32_ll_cmp.c
 * @brief This file provides firmware functions to manage the Comparator(CMP).
 *
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_cmp.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_CMP CMP
 * @brief CMP Driver Library
 * @{
 */

#if (LL_CMP_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CMP_Local_Macros CMP Local Macros
 * @{
 */

/**
 * @defgroup CMP_Check_Parameters_Validity CMP Check Parameters Validity
 * @{
 */
#define IS_CMP_UNIT(x)                                                         \
(   ((x) == CM_CMP1)                            ||                             \
    ((x) == CM_CMP2)                            ||                             \
    ((x) == CM_CMP3))

#define CMP1_INP4_MASK                       (CMP1_POSITIVE_PGAO      |        \
                                              CMP1_POSITIVE_PGAO_BP   |        \
                                              CMP1_POSITIVE_CMP1_INP4)
#define CMP1_POSITIVE_MASK                   (CMP_POSITIVE_NONE       |        \
                                              CMP1_POSITIVE_CMP1_INP1 |        \
                                              CMP1_POSITIVE_CMP1_INP2 |        \
                                              CMP1_POSITIVE_CMP1_INP3 |        \
                                              CMP1_INP4_MASK)

#define CMP2_INP4_MASK                       (CMP2_POSITIVE_PGAO      |        \
                                              CMP2_POSITIVE_PGAO_BP)
#define CMP2_POSITIVE_MASK                   (CMP_POSITIVE_NONE       |        \
                                              CMP2_POSITIVE_CMP2_INP1 |        \
                                              CMP2_POSITIVE_CMP2_INP2 |        \
                                              CMP2_POSITIVE_CMP2_INP3 |        \
                                              CMP2_INP4_MASK)

#define CMP3_POSITIVE_MASK                   (CMP_POSITIVE_NONE       |        \
                                              CMP3_POSITIVE_CMP3_INP1 |        \
                                              CMP3_POSITIVE_CMP3_INP2 |        \
                                              CMP3_POSITIVE_CMP3_INP3 |        \
                                              CMP3_POSITIVE_CMP3_INP4)

#define IS_CMP1_POSITIVE_IN(x)                                                 \
(   (((x) & (~CMP1_POSITIVE_MASK)) == 0U) &&                                   \
    ((((x) & CMP1_INP4_MASK) == 0U) ||                                         \
     (((x) & CMP1_INP4_MASK) == CMP1_POSITIVE_PGAO) ||                         \
     (((x) & CMP1_INP4_MASK) == CMP1_POSITIVE_PGAO_BP) ||                      \
     (((x) & CMP1_INP4_MASK) == CMP1_POSITIVE_CMP1_INP4)))

#define IS_CMP2_POSITIVE_IN(x)                                                 \
(   (((x) & (~CMP2_POSITIVE_MASK)) == 0U) &&                                   \
    ((((x) & CMP2_INP4_MASK) == 0U) ||                                         \
     (((x) & CMP2_INP4_MASK) == CMP2_POSITIVE_PGAO) ||                         \
     (((x) & CMP2_INP4_MASK) == CMP2_POSITIVE_PGAO_BP)))

#define IS_CMP3_POSITIVE_IN(x)                                                 \
(   ((x) & (~CMP3_POSITIVE_MASK)) == 0U)

#define IS_CMP_NEGATIVE_IN(x)                                                  \
(   ((x) == CMP_NEGATIVE_NONE)                  ||                             \
    ((x) == CMP1_NEGATIVE_CMP1_INM1)            ||                             \
    ((x) == CMP1_NEGATIVE_CMP1_INM2)            ||                             \
    ((x) == CMP1_NEGATIVE_DAC1)                 ||                             \
    ((x) == CMP1_NEGATIVE_VREF))

#define IS_CMP_SCAN_STABLE(x)                                                  \
(   (x) < 16U)

#define IS_CMP_SCAN_PERIOD(x)                                                  \
(   (x) >= 0xFU)

#define IS_CMP_8_BIT_DAC_CH(x)                                                 \
(   ((x) == CMP_8BITDAC_CH1)                    ||                             \
    ((x) == CMP_8BITDAC_CH2))

#define IS_CMP_8_BIT_DAC_DATA(x)                                               \
(   (x) <= 0xFFU)

#define IS_CMP_8_BIT_DAC_SW(x)                                                 \
(   ((x) == CMP_ADC_REF_VREF)                   ||                             \
    ((x) == CMP_ADC_REF_DA2)                    ||                             \
    ((x) == CMP_ADC_REF_DA1))

#define IS_CMP_OUT_POLARITY(x)                                                 \
(   ((x) == CMP_OUT_INVT_OFF)                   ||                             \
    ((x) == CMP_OUT_INVT_ON))

#define IS_CMP_OUT_FILTER(x)                                                   \
(   ((x) == CMP_OUT_FILTER_NONE)                ||                             \
    ((x) == CMP_OUT_FILTER_CLK)                 ||                             \
    ((x) == CMP_OUT_FILTER_CLK_DIV2)            ||                             \
    ((x) == CMP_OUT_FILTER_CLK_DIV4)            ||                             \
    ((x) == CMP_OUT_FILTER_CLK_DIV8)            ||                             \
    ((x) == CMP_OUT_FILTER_CLK_DIV16)           ||                             \
    ((x) == CMP_OUT_FILTER_CLK_DIV32)           ||                             \
    ((x) == CMP_OUT_FILTER_CLK_DIV64))

#define IS_CMP_OUT_DETECT_EDGE(x)                                              \
(   ((x) == CMP_DETECT_EDGS_NONE)               ||                             \
    ((x) == CMP_DETECT_EDGS_RISING)             ||                             \
    ((x) == CMP_DETECT_EDGS_FALLING)            ||                             \
    ((x) == CMP_DETECT_EDGS_BOTH))

/**
 * @}
 */
#define CMP_DADC_RVADC_REG_UNLOCK               (0x5500U)
/**
 * @}
 */

