RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_cmp.c
    /* CMP output polarity selection */
    MODIFY_REG16(CMPx->CTRL, CMP_CTRL_INV, u16CmpPolarity);
    /* Recover CMP function */
    RecoverCmpFuncStatus(CMPx, u16temp);
}

/**
 * @brief  Set positive in(compare voltage)
 * @param  [in] CMPx                Pointer to CMP instance register base
 *   @arg  CM_CMPx
 * @param  [in] u16PositiveInput    @ref CMP_Positive_Input_Select
 * @retval None
 */
void CMP_SetPositiveInput(CM_CMP_TypeDef *CMPx, uint16_t u16PositiveInput)
{
    uint16_t u16temp;
    /* Check parameters */
    DDL_ASSERT(IS_CMP_UNIT(CMPx));
    if (CM_CMP1 == CMPx) {
        DDL_ASSERT(IS_CMP1_POSITIVE_IN(u16PositiveInput));
    } else if (CM_CMP2 == CMPx) {
        DDL_ASSERT(IS_CMP2_POSITIVE_IN(u16PositiveInput));
    } else {
        DDL_ASSERT(IS_CMP3_POSITIVE_IN(u16PositiveInput));
    }

    /* Read CMP status */
    u16temp = GetCmpFuncStatusAndDisFunc(CMPx);

    /* Set voltage in */
    MODIFY_REG16(CMPx->VLTSEL, (CMP_VLTSEL_CVSL | CMP_VLTSEL_C4SL), u16PositiveInput);

    /* Recover CMP function */
    RecoverCmpFuncStatus(CMPx, u16temp);
}

/**
 * @brief  Set negative in(reference voltage)
 * @param  [in] CMPx                Pointer to CMP instance register base
 *   @arg  CM_CMPx
 * @param  [in] u16NegativeInput    @ref CMP_Negative_Input_Select
 * @retval None
 */
void CMP_SetNegativeInput(CM_CMP_TypeDef *CMPx, uint16_t u16NegativeInput)
{
    uint16_t u16temp;
    /* Check parameters */
    DDL_ASSERT(IS_CMP_UNIT(CMPx));
    DDL_ASSERT(IS_CMP_NEGATIVE_IN(u16NegativeInput));
    /* Read CMP status */
    u16temp = GetCmpFuncStatusAndDisFunc(CMPx);

    /* Set voltage in */
    MODIFY_REG16(CMPx->VLTSEL, CMP_VLTSEL_RVSL, u16NegativeInput);

    /* Recover CMP function */
    RecoverCmpFuncStatus(CMPx, u16temp);
}

/**
 * @brief  Get CMP scan INP source
 * @param  [in] CMPx                Pointer to CMP instance register base
 *   @arg  CM_CMPx
 * @retval An uint16_t value @ref CMP_Scan_Inp_Status
 */
uint16_t CMP_GetScanInpSrc(CM_CMP_TypeDef *CMPx)
{
    /* Check parameters */
    DDL_ASSERT(IS_CMP_UNIT(CMPx));
    return READ_REG16_BIT(CMPx->OUTMON, CMP_OUTMON_CVST);
}

/**
 * @brief  Get CMP scan function stable time and period configuration
 * @param  [in] CMPx                Pointer to CMP instance register base
 *   @arg  CM_CMPx
 * @param  [in] u8ScanStable        CMP scan stable value
 *   @arg  u8ScanStable < 16
 * @param  [in] u8ScanPeriod        CMP scan period value
 *   @arg  u8ScanPeriod range(0x0F ~ 0xFF)
 * @retval int32_t
 *         - LL_OK:                 Success
 *         - LL_ERR_INVD_PARAM:     Parameter error
 * @note   1. u8ScanPeriod > (u8ScanStable + u16OutFilter * 4 + 5)
 *            u16OutFilter is configurate in CMP_NormalModeInit() function.
 *         2. Scan stable time = u8ScanStable * T(pclk3)
 *            The typical value of Scan stable time is 100nS and Scan stable time < 200nS
 */
int32_t CMP_ScanTimeConfig(CM_CMP_TypeDef *CMPx, uint8_t u8ScanStable, uint8_t u8ScanPeriod)
{
    uint16_t u16Flts;
    uint16_t u16FltslDiv;
    int32_t i32Ret = LL_OK;
    /* Check parameters */
    DDL_ASSERT(IS_CMP_UNIT(CMPx));
    DDL_ASSERT(IS_CMP_SCAN_STABLE(u8ScanStable));
    DDL_ASSERT(IS_CMP_SCAN_PERIOD(u8ScanPeriod));

    u16Flts = READ_REG16_BIT(CMPx->CTRL, CMP_CTRL_FLTSL);
    if (0U != u16Flts) {
        u16FltslDiv = ((uint16_t)1U << (u16Flts - 1U));
    } else {
        u16FltslDiv = 0U;
    }

    if (u8ScanPeriod <= (u8ScanStable + u16FltslDiv * 4U + 5U)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        WRITE_REG16(CMPx->CVSSTB, u8ScanStable);
        WRITE_REG16(CMPx->CVSPRD, u8ScanPeriod);
    }
    return i32Ret;
}

/**
 * @brief  CMP scan function command
 * @param  [in] CMPx                Pointer to CMP instance register base
 *   @arg  CM_CMPx
 * @param  [in] enNewState          An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void CMP_ScanCmd(CM_CMP_TypeDef *CMPx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_CMP_UNIT(CMPx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG16_BIT(CMPx->CTRL, CMP_CTRL_CVSEN);
    } else {
        CLR_REG16_BIT(CMPx->CTRL, CMP_CTRL_CVSEN);
    }
}

/**
 * @brief  CMP 8 bit DAC reference voltage command
 * @param  [in] u8Ch                The DAC channel @ref CMP_8Bit_Dac_Ch
 * @param  [in] enNewState          An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void CMP_8BitDAC_Cmd(uint8_t u8Ch, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_CMP_8_BIT_DAC_CH(u8Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG16_BIT(CM_CMPCR->DACR, u8Ch);
    } else {
        CLR_REG16_BIT(CM_CMPCR->DACR, u8Ch);
    }
}

/**
 * @brief  CMP 8 bit DAC connect to ADC reference voltage command
 * @param  [in] u16AdcRefSw         @ref CMP_8BitDAC_Adc_Ref_Switch
 * @param  [in] enNewState          An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void CMP_8BitDAC_AdcRefCmd(uint16_t u16AdcRefSw, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_CMP_8_BIT_DAC_SW(u16AdcRefSw));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    uint16_t WrTmp;
    if (ENABLE == enNewState) {
        WrTmp = u16AdcRefSw;
    } else {
        WrTmp = 0U;
    }
    WRITE_REG16(CM_CMPCR->RVADC, CMP_DADC_RVADC_REG_UNLOCK);
    WRITE_REG16(CM_CMPCR->RVADC, WrTmp);
}

/**
 * @brief  Write raw data to DAC
 * @param  [in] u8Ch             DAC channel @ref CMP_8Bit_Dac_Ch
 * @param  [in] u16DACData       DAC voltage data
 * @retval None
 */
void CMP_8BitDAC_WriteData(uint8_t u8Ch, uint16_t u16DACData)
{
    DDL_ASSERT(IS_CMP_8_BIT_DAC_CH(u8Ch));
    DDL_ASSERT(IS_CMP_8_BIT_DAC_DATA(u16DACData));

    if (CMP_8BITDAC_CH1 == u8Ch) {
        WRITE_REG16(CM_CMPCR->DADR1, u16DACData);
    } else {
        WRITE_REG16(CM_CMPCR->DADR2, u16DACData);
    }
}

/**
 * @}
 */

#endif  /* LL_CMP_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
